'''
7. Реализовать генератор с помощью функции с ключевым словом yield,
 создающим очередное значение. При вызове функции должен создаваться объект-генератор.
 Функция должна вызываться следующим образом: for el in fibo_gen(). Функция отвечает
 за получение факториала числа, а в цикле необходимо выводить только первые 15 чисел.
Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх
4! = 1 * 2 * 3 * 4 = 24.
'''
'''
def generator():
    for el in (10, 20, 30):
        yield el

g = generator()
print(g)

for el in g:
    print(el)
'''
i=0
n=int(input("Введите целое число: "))
def fibo_gen(n):
    x=1
    for el in range(1,n):
        x = x * el
        yield x

for el in fibo_gen(n):
    if i==15:
        break
    print(el)
    i+=1
