"""
 Реализовать программу работы с органическими клетками. Необходимо создать класс Клетка. В его
 конструкторе инициализировать параметр, соответствующий количеству клеток (целое число). В классе
 должны быть реализованы методы перегрузки арифметических операторов: сложение (add()), вычитание
 (sub()), умножение (mul()), деление (truediv()).Данные методы должны применяться только к клеткам
 и выполнять увеличение, уменьшение, умножение и обычное (не целочисленное) деление клеток,
 соответственно. В методе деления должно осуществляться округление значения до целого числа.
Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться сумме
ячеек исходных двух клеток.
Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если разность количества
ячеек двух клеток больше нуля, иначе выводить соответствующее сообщение.
Умножение. Создается общая клетка из двух. Число ячеек общей клетки определяется как произведение
количества ячеек этих двух клеток.
Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется как целочисленное
деление количества ячеек этих двух клеток.
В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество
ячеек в ряду. Данный метод позволяет организовать ячейки по рядам.
Метод должен возвращать строку вида **\n\n***..., где количество ячеек между \n равно
переданному аргументу. Если ячеек на формирование ряда не хватает, то в последний ряд
записываются все оставшиеся.
Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5. Тогда метод
make_order() вернет строку: **\n\n.
Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5. Тогда метод
make_order() вернет строку: **\n\n***.
Подсказка: подробный список операторов для перегрузки доступен по ссылке.

"""


class Cell():
    def __init__(self, cellqty):
        self.cellqty = cellqty
    def __str__(self):
        return "Количество клеток равно " + str(self.cellqty)

    def __add__(self, other):
        return Cell(self.cellqty+other.cellqty)

    def __sub__(self, other):
        if self.cellqty<=other.cellqty:
            print("Вычитание невозможно.")
            return Cell(0)
        else:
            return Cell(self.cellqty-other.cellqty)

    def __mul__(self, other):
        return Cell(self.cellqty * other.cellqty)

    def __truediv__(self, other):
        if self.cellqty <= other.cellqty:
            print("Деление невозможно.")
            return Cell(0)
        else:
            return Cell(self.cellqty // other.cellqty)

    def make_order(self, param):
        row_qty = self.cellqty // param
        last_qty = self.cellqty % param
        for i in range(row_qty):
            print("*" * param)
        print("*" * last_qty)


my_class1 = Cell(14)
my_class2 = Cell(34)
print(str(my_class1+my_class2))
print(str(my_class1-my_class2))
print(str(my_class1*my_class2))
print(str(my_class1/my_class2))
my_class1.make_order(3)
