"""
Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
Значения данных атрибутов должны передаваться при создании экземпляра класса.
Атрибуты сделать защищенными. Определить метод расчета массы асфальта, необходимого
для покрытия всего дорожного полотна. Использовать формулу: длинаширинамасса асфальта
для покрытия одного кв метра дороги асфальтом, толщиной в 1 см*число см толщины полотна.
Проверить работу метода.
Например: 20м*5000м*25кг*5см = 12500 т

"""

class Road:
    length = 0
    width = 0
    def __init__(self, Rlength, Rwidth):
        self.length = Rlength
        self.width = Rwidth
    def getMaterial(self, rate,depth):
        return self.length*self.width*rate*depth

my_Road = Road(20,5000)
print("Необходимое количество асфальта {} тонн".format(my_Road.getMaterial(25,5)/1000))
